n=int(input("輸入度數(正整數):"))
if n<=120:
    summer=n*2.10
    notsm=n*2.10
    print("夏月:%0.2f 非夏月:%0.2f"%(summer,notsm))
elif n>120 and n<=330:
    summer=120*2.10+(n-120)*3.02
    notsm=120*2.10+(n-120)*2.68
    print("夏月:%0.2f 非夏月:%0.2f"%(summer,notsm))
elif n>330 and n<=500:
    summer=120*2.10+210*3.02+(n-120-210)*4.39
    notsm=120*2.10+210*2.68+(n-120-210)*3.61
    print("夏月:%0.2f 非夏月:%0.2f"%(summer,notsm))
elif n>200 and n<=700:
    summer=120*2.10+210*3.02+170*4.39+(n-120-210-170)*4.97
    notsm=120*2.10+210*2.68+170*3.61+(n-120-210-170)*4.01
    print("夏月:%0.2f 非夏月:%0.2f"%(summer,notsm))
elif n>700:
    summer=120*2.10+210*3.02+170*4.39+200*4.97+(n-120-210-170-200)*5.63
    notsm=120*2.10+210*2.68+170*3.61+200*4.01+(n-120-210-170-200)*4.50
    print("夏月:%0.2f 非夏月:%0.2f"%(summer,notsm))
